In [8]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [9]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

Exception during reset or similar
Traceback (most recent call last):
  File "/opt/conda/lib/python3.6/site-packages/sqlalchemy/pool.py", line 687, in _finalize_fairy
    fairy._reset(pool)
  File "/opt/conda/lib/python3.6/site-packages/sqlalchemy/pool.py", line 829, in _reset
    pool._dialect.do_rollback(self)
  File "/opt/conda/lib/python3.6/site-packages/sqlalchemy/engine/default.py", line 440, in do_rollback
    dbapi_connection.rollback()
psycopg2.OperationalError: terminating connection due to administrator command
server closed the connection unexpectedly
	This probably means the server terminated abnormally
	before or while processing the request.

'Connected: student@sparkifydb'

In [16]:
%sql SELECT * FROM songplays WHERE song_id IS NOT NULL LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(5662, '1542837407796', 15, 'paid', 'SOZCTXZ12AB0182364', 'AR5KOSW1187FB35FF4', 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"')]

In [11]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(47, 'Kimber', 'Norris', 'F', 'free'),
 (56, 'Cienna', 'Freeman', 'F', 'free'),
 (98, 'Jordyn', 'Powell', 'F', 'free'),
 (32, 'Lily', 'Burns', 'F', 'free'),
 (101, 'Jayden', 'Fox', 'M', 'free')]

In [12]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOFNOQK12AB01840FC', 'Kutt Free (DJ Volume Remix)', 'ARNNKDK1187B98BBD5', 0, Decimal('407.37914')),
 ('SOBAYLL12A8C138AF9', 'Sono andati? Fingevo di dormire', 'ARDR4AC1187FB371A1', 0, Decimal('511.16363')),
 ('SOFFKZS12AB017F194', 'A Higher Place (Album Version)', 'ARBEBBY1187B9B43DB', 1994, Decimal('236.17261')),
 ('SOGVQGJ12AB017F169', 'Ten Tonne', 'AR62SOJ1187FB47BB5', 2005, Decimal('337.68444')),
 ('SOXILUQ12A58A7C72A', 'Jenny Take a Ride', 'ARP6N5A1187B99D1A3', 2004, Decimal('207.43791'))]

In [13]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('ARNNKDK1187B98BBD5', 'Jinx', 'Zagreb Croatia', Decimal('45.80726'), Decimal('15.967600000000001')),
 ('ARDR4AC1187FB371A1', 'Montserrat Caball√©;Placido Domingo;Vicente Sardinero;Judith Blegen;Sherrill Milnes;Georg Solti', '', Decimal('NaN'), Decimal('NaN')),
 ('ARBEBBY1187B9B43DB', 'Tom Petty', 'Gainesville, FL', Decimal('NaN'), Decimal('NaN')),
 ('AR62SOJ1187FB47BB5', 'Chase & Status', '', Decimal('NaN'), Decimal('NaN')),
 ('ARP6N5A1187B99D1A3', 'Mitch Ryder', 'Hamtramck, MI', Decimal('NaN'), Decimal('NaN'))]

In [14]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('2018-11-29 00:00:57.796', 0, '29', '48', 11, 2018, '3'),
 ('2018-11-29 00:01:30.796', 0, '29', '48', 11, 2018, '3'),
 ('2018-11-29 00:04:01.796', 0, '29', '48', 11, 2018, '3'),
 ('2018-11-29 00:04:55.796', 0, '29', '48', 11, 2018, '3'),
 ('2018-11-29 00:07:13.796', 0, '29', '48', 11, 2018, '3')]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).